<template>
  <div class="relative">
    <div class="lg:mx-auto lg:max-w-7xl lg:px-8 lg:grid lg:grid-cols-2 lg:gap-24 lg:items-start">
      <div class="relative mx-auto max-w-md px-4 sm:max-w-3xl sm:px-6 lg:px-0">
        <!-- Content area -->
        <div>
          <div class="text-gray-500 space-y-6">
            <p class="text-base leading-7">
              Мы запустили сервис в открытый доступ 9 июня 2015 года. Тогда он назывался Старонка 
              ("страница" по-беларусски, ведь мы из прекрасного Минска) и был просто конструктором сайтов.
              Подробнее о наших приключениях каждый год можно почитать в нашем блоге (год один, два, три, пять).
              Приключений было много: удачные и не очень рекламные кампании, изменения в команде,
              интересные истории клиентов. Нам есть, о чем рассказать!
            </p>
            <p class="text-base leading-7">
              Со временем мы поняли, что сайт это не цель, а один из инструментов в развитии бизнеса,
              и стали выстраивать настоящую экосистему вокруг конструктора: добавление товаров, работа
              с заказами, интеграция писем, платежи, внутренняя CRM-система. Оказалось, что мы переросли
              Старонку, ведь теперь это намного больше, чем просто сайт. Так появился 🌱kvitly
              (от беларусского “квітнець” — цвести).
            </p>
            <p class="text-base leading-7">
              Сейчас мы сами малый бизнес, и поэтому хорошо понимаем, с чем каждый день сталкиваются
              предприниматели. Мы растем вместе с нашими смелыми, свободными и увлеченными клиентами.
              Мы слышим предпринимателей и развиваем продукт откликаясь на больные места в их повседневной
              работе. Именно поэтому 🌱kvitly стал именно таким: гибким, отзывчивым и простым в использовании.
            </p>
          </div>
        </div>
      </div>
      <div class="relative sm:py-16 lg:py-0">
        <div aria-hidden="true" class="hidden sm:block pointer-events-none lg:absolute lg:inset-y-0 lg:right-0 lg:w-screen">
          <!-- <div class="absolute inset-y-0 right-1/2 w-full bg-gray-50 rounded-r-3xl lg:right-72" /> -->
          <svg class="absolute top-8 left-1/2 -ml-3 lg:-right-8 lg:left-auto lg:top-12" width="404" height="392" fill="none" viewBox="0 0 404 392">
            <defs>
              <pattern id="02f20b47-fd69-4224-a62a-4c9de5c763f7" x="0" y="0" width="20" height="20" patternUnits="userSpaceOnUse">
                <rect x="0" y="0" width="4" height="4" class="text-gray-200" fill="currentColor" />
              </pattern>
            </defs>
            <rect width="404" height="392" fill="url(#02f20b47-fd69-4224-a62a-4c9de5c763f7)" />
          </svg>
        </div>
        <div class="relative mx-auto max-w-md px-4 sm:max-w-3xl sm:px-6 lg:px-0 lg:max-w-none lg:py-20">
          <figure>
            <div class="aspect-w-12 aspect-h-7 lg:aspect-none">
              <img class="rounded-lg shadow-lg object-cover object-center" src="~/assets/kvitly-team.jpg" alt="Whitney leaning against a railing on a downtown street" width="1184" height="1376" />
            </div>
          </figure>
        </div>
      </div>
    </div>
  </div>
</template>
